{"name": "functional", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 19, 4], "dtype": "float32", "sparse": false, "ragged": false, "name": "seq_onehot_input", "optional": false}, "registered_name": null, "name": "seq_onehot_input", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": 19}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}, "registered_name": null, "build_config": {"input_shape": [null, 19, 4]}, "name": "dense", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 4], "dtype": "float32", "keras_history": ["seq_onehot_input", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.src.ops.numpy", "class_name": "Add", "config": {"name": "add"}, "registered_name": "Add", "name": "add", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["dense", 0, 0]}}, {"class_name": "__tensor__", "config": {"value": [[-0.295669287443161, 0.0855497419834137, -0.11463567614555359, -0.30875882506370544, 0.1228596568107605, 0.23444190621376038, -0.12357315421104431, 0.011413753032684326, 0.14499902725219727, 0.2992900311946869, -0.16612812876701355, -0.22602103650569916, -0.13528940081596375, 0.29457196593284607, -0.07088837027549744, -0.21936292946338654, 0.011333554983139038, -0.28754833340644836, -0.146639883518219, -0.007421582937240601, 0.2721985876560211, 0.1772427260875702, -0.14581352472305298, -0.09562253952026367, 0.2333991825580597, -0.01924234628677368, 0.10542342066764832, 0.15273961424827576, -0.2598111629486084, -0.20135998725891113, -0.06913378834724426, -0.025286227464675903], [0.1709391176700592, -0.21089386940002441, -0.23290526866912842, -0.3191685974597931, -0.3410489857196808, -0.012771576642990112, 0.020692497491836548, -0.03709137439727783, 0.22953328490257263, 0.2189129889011383, -0.21844211220741272, -0.3057510554790497, -0.0022554993629455566, -0.337831974029541, 0.15089702606201172, -0.28983113169670105, 0.20015403628349304, 0.20087268948554993, -0.07877722382545471, -0.19684018194675446, -0.20519638061523438, 0.012883305549621582, 0.130886048078537, -0.099777951836586, 0.2354547679424286, -0.267848938703537, -0.3263663649559021, -0.13219235837459564, 0.16502568125724792, -0.3087071180343628, -0.03770831227302551, -0.23424729704856873], [-0.07071134448051453, -0.13408957421779633, -0.28212088346481323, 0.1749897301197052, -0.11374127864837646, 0.2892623245716095, -0.18766440451145172, -0.13977192342281342, -0.08011755347251892, -0.07174345850944519, -0.321209192276001, -0.10282087326049805, 0.12360471487045288, -0.17567354440689087, -0.26876354217529297, -0.09343844652175903, 0.12088817358016968, -0.20977090299129486, 0.3057754933834076, 0.27482685446739197, -0.2358027845621109, 0.12892642617225647, 0.3108382523059845, -0.1502051055431366, 0.10648882389068604, 0.008048802614212036, 0.25103864073753357, -0.29601535201072693, -0.16128545999526978, -0.17706283926963806, -0.034020423889160156, 0.32317736744880676], [-0.1620955467224121, -0.2693479061126709, 0.19976428151130676, -0.2285373955965042, 0.16044315695762634, -0.17515809834003448, 0.10274603962898254, -0.32600826025009155, -0.21321624517440796, 0.06586113572120667, 0.24673113226890564, 0.1174059510231018, -0.058033138513565063, 0.0689358115196228, 0.19298270344734192, 0.06799232959747314, 0.13466742634773254, 0.23313340544700623, 0.19689258933067322, -0.02598312497138977, 0.3408460319042206, -0.1766132414340973, 0.03897961974143982, 0.1510598361492157, -0.1676589995622635, 0.22533395886421204, -0.3207944929599762, 0.2849733531475067, 0.2045123279094696, -0.07448762655258179, -0.24836134910583496, -0.13414199650287628], [0.014750927686691284, -0.19981366395950317, -0.2736397981643677, -0.0798502266407013, -0.05144330859184265, 0.039944976568222046, -0.2367965281009674, 0.16327843070030212, -0.18658944964408875, -0.3228818476200104, -0.09759451448917389, 0.21994492411613464, -0.21236641705036163, -0.23448142409324646, -0.20812252163887024, -0.16633740067481995, -0.2953142821788788, -0.2324727475643158, -0.1824304312467575, 0.1682392656803131, 0.2961817681789398, 0.1741374433040619, 0.019359290599822998, 0.17079302668571472, -0.20797769725322723, -0.18499822914600372, -0.09061476588249207, -0.3187131881713867, -0.30579015612602234, -0.28324589133262634, -0.27300113439559937, 0.31949761509895325], [0.24689361453056335, 0.13868266344070435, -0.10891497135162354, 0.3237042725086212, -0.24579894542694092, 0.2421480119228363, 0.29073092341423035, 0.019150346517562866, -0.13973087072372437, -0.0880064070224762, 0.14648711681365967, 0.060138970613479614, -0.26731207966804504, -0.13691072165966034, 0.28354325890541077, 0.2428494393825531, -0.3202396333217621, 0.05255180597305298, -0.16102533042430878, -0.016566842794418335, 0.12273198366165161, -0.3251635730266571, -0.3069041967391968, -0.33361268043518066, 0.0951816737651825, -0.2704644203186035, -0.24391970038414001, 0.05787423253059387, 0.0807543694972992, -0.0052877068519592285, 0.2074141800403595, 0.15108075737953186], [-0.1333906352519989, 0.04744336009025574, -0.03168398141860962, 0.05703619122505188, 0.23545876145362854, 0.08033263683319092, 0.13827499747276306, 0.04752987623214722, 0.011483430862426758, -0.18201778829097748, 0.12824824452400208, -0.31256192922592163, 0.04653128981590271, 0.11353060603141785, -0.02024140954017639, -0.1768786907196045, 0.23447391390800476, 0.1714174449443817, -0.07502222061157227, -0.13143502175807953, -0.2747848629951477, 0.31178340315818787, -0.20462419092655182, 0.26863667368888855, 0.2099045217037201, -0.017871767282485962, -0.01943984627723694, 0.3351477086544037, 0.03098297119140625, 0.2305295765399933, -0.014770954847335815, 0.33293256163597107], [0.23244896531105042, 0.21572640538215637, -0.10142910480499268, 0.07849487662315369, -0.3293358385562897, 0.33189627528190613, -0.0031280517578125, 0.03842321038246155, -0.2813445031642914, -0.08429914712905884, 0.28643104434013367, -0.2909846901893616, -0.23511242866516113, 0.18447348475456238, -0.29511335492134094, 0.2249005138874054, -0.31677865982055664, 0.18687066435813904, 0.2549191415309906, 0.07982832193374634, 0.17524060606956482, 0.09470027685165405, 0.07399526238441467, 0.3181973397731781, 0.20691564679145813, -0.17825506627559662, 0.08425325155258179, 0.10116660594940186, -0.2533629834651947, -0.23884734511375427, 0.0508323609828949, 0.18411657214164734], [0.14447858929634094, -0.3145770728588104, 0.14795827865600586, 0.33317068219184875, -0.2641216218471527, -0.2713714838027954, 0.10857534408569336, 0.13996458053588867, -0.029570847749710083, 0.2520395815372467, -0.1543228179216385, -0.18115757405757904, 0.29098787903785706, -0.002915024757385254, -0.273255854845047, -0.0054732561111450195, -0.05424761772155762, 0.3385777175426483, 0.05852225422859192, 0.20025625824928284, 0.06096458435058594, -0.3427596688270569, 0.21904495358467102, 0.0192263126373291, -0.2259366512298584, -0.30268827080726624, -0.1209215372800827, -0.04716464877128601, -0.16966506838798523, 0.2690030634403229, 0.1487376093864441, -0.2756231427192688], [-0.20201118290424347, 0.29172298312187195, -0.23564977943897247, -0.12421216070652008, -0.299201637506485, -0.10456770658493042, 0.07883498072624207, 0.21579071879386902, -0.1060015857219696, -0.31847652792930603, -0.29987865686416626, 0.21739980578422546, -0.3198533058166504, -0.24323761463165283, -0.12124161422252655, 0.06392958760261536, -0.15022023022174835, -0.1993602216243744, -0.2341998815536499, 0.23929789662361145, 0.009332448244094849, 0.19775471091270447, -0.3029046654701233, 0.10346004366874695, 0.2651180922985077, 0.30091241002082825, 0.06231105327606201, 0.19513359665870667, 0.09602135419845581, 0.23077741265296936, -0.020652592182159424, -0.23830923438072205], [0.17445781826972961, -0.2771472930908203, 0.13690811395645142, 0.20463266968727112, 0.2926616966724396, 0.04559716582298279, 0.10974204540252686, 0.33892378211021423, 0.16578951478004456, -0.2915186882019043, -0.09928721189498901, -0.02501767873764038, 0.12000662088394165, 0.14075815677642822, -0.20701265335083008, -0.1372816562652588, -0.18095289170742035, -0.2883724868297577, -0.25038132071495056, -0.24036657810211182, 0.14897584915161133, -0.10371649265289307, 0.15716871619224548, -0.08075845241546631, 0.030522823333740234, 0.28467151522636414, 0.22532299160957336, -0.1646702140569687, -0.19618432223796844, -0.10306383669376373, -0.2862066328525543, 0.007177233695983887], [0.34082141518592834, 0.15235412120819092, 0.2517349421977997, -0.22651350498199463, -0.16990426182746887, -0.3015635013580322, -0.185951828956604, -0.21761469542980194, -0.04365316033363342, -0.08656787872314453, -0.15000523626804352, -0.12958285212516785, 0.28563860058784485, 0.0551304817199707, -0.07928213477134705, 0.20604482293128967, -0.2333373725414276, -0.0012746453285217285, -0.14485231041908264, -0.014610499143600464, 0.2773742973804474, -0.07508191466331482, 0.06474629044532776, -0.32278135418891907, -0.003519505262374878, 0.16089364886283875, -0.13984331488609314, -0.23438182473182678, -0.223595529794693, -0.024292975664138794, -0.31465673446655273, 0.0826166570186615], [-0.020920485258102417, 0.32853564620018005, 0.3096102774143219, 0.06700807809829712, -0.2729104459285736, 0.027188122272491455, -0.3322322964668274, -0.24767008423805237, -0.14780086278915405, -0.16095492243766785, -0.1152990460395813, -0.34082311391830444, -0.2241174280643463, 0.062377363443374634, -0.0781707763671875, 0.17254415154457092, -0.18189111351966858, 0.20958444476127625, -0.23061607778072357, 0.16271236538887024, -0.04062372446060181, -0.3377683460712433, 0.01936069130897522, -0.0950530469417572, 0.009344726800918579, 0.1539013385772705, 0.24741074442863464, -0.2640979290008545, 0.3254563510417938, 0.22527244687080383, -0.13960224390029907, -0.2564186453819275], [0.02715173363685608, -0.0447084903717041, 0.06676125526428223, 0.0025300979614257812, 0.30991891026496887, 0.3410092294216156, 0.28426608443260193, -0.3370826542377472, -0.26825886964797974, 0.2831108868122101, -0.11725383996963501, 0.27047666907310486, -0.2533978819847107, -0.3344511389732361, -0.22401325404644012, -0.2699090540409088, -0.007119238376617432, -0.18522794544696808, -0.014445573091506958, 0.17627111077308655, 0.09736618399620056, -0.15367931127548218, 0.1792745292186737, -0.34128573536872864, -0.029498159885406494, -0.3066323697566986, 0.14040112495422363, 0.20150962471961975, 0.2259523570537567, -0.04915428161621094, 0.0416887104511261, -0.08497625589370728], [-0.14547652006149292, 0.08297175168991089, 0.2598535120487213, -0.3051379919052124, -0.22496317327022552, 0.1770283281803131, 0.03459352254867554, -0.1481318175792694, 0.203190416097641, 0.17880365252494812, 0.1397269368171692, 0.13113504648208618, -0.0029206573963165283, -0.15393191576004028, -0.10995084047317505, 0.11792728304862976, -0.11381871998310089, 0.1581609547138214, 0.3144572079181671, 0.17007091641426086, 0.008715629577636719, 0.11278915405273438, -0.18974873423576355, -0.1960783451795578, -0.3046454191207886, 0.2895951569080353, -0.056101977825164795, 0.022743135690689087, 0.07199114561080933, 0.28059831261634827, 0.1722811758518219, -0.3236393332481384], [0.22338607907295227, 0.019145935773849487, 0.12639853358268738, 0.15381914377212524, 0.10746154189109802, -0.07435360550880432, -0.2130076289176941, 0.14510288834571838, -0.12488901615142822, -0.3353026211261749, -0.0017275512218475342, -0.25303030014038086, -0.25757139921188354, 0.29479166865348816, 0.22112330794334412, -0.22558124363422394, -0.1128862202167511, 0.011259377002716064, -0.28195422887802124, -0.18124720454216003, -0.12193107604980469, -0.286339670419693, -0.021489828824996948, 0.19424638152122498, 0.06459876894950867, 0.030789166688919067, 0.04020372033119202, 0.34221020340919495, 0.23829755187034607, -0.11329461634159088, 0.26327672600746155, 0.12084588408470154], [-0.264900803565979, 0.24405589699745178, -0.07650595903396606, 0.18310663104057312, 0.08763235807418823, 0.32406899333000183, -0.1611863523721695, -0.22700989246368408, -0.10414999723434448, 0.08516925573348999, 0.14082661271095276, 0.32296445965766907, -0.2450605034828186, 0.04655337333679199, 0.12828195095062256, -0.28058895468711853, 0.14624056220054626, 0.04750755429267883, -0.02035999298095703, -0.10275986790657043, -0.22453948855400085, -0.3275032937526703, -0.07703357934951782, 0.3303127586841583, -0.0029482245445251465, 0.21947380900382996, -0.28787365555763245, -0.14898131787776947, 0.3139505684375763, -0.030610978603363037, -0.13526323437690735, 0.2150585949420929], [0.01540529727935791, -0.27243825793266296, -0.1741495430469513, 0.18385866284370422, -0.001183152198791504, -0.30507174134254456, 0.11440643668174744, 0.18466171622276306, 0.0547715425491333, -0.25104451179504395, 0.25672516226768494, 0.23007521033287048, 0.21749737858772278, -0.11789275705814362, -0.23590043187141418, -0.025577187538146973, -0.1399851143360138, -0.01823216676712036, -0.045484304428100586, 0.136881023645401, -0.10781122744083405, -0.13788394629955292, 0.014290034770965576, 0.14533987641334534, 0.14889609813690186, -0.024025559425354004, 0.18631669878959656, -0.26023149490356445, -0.16429567337036133, -0.1702030748128891, -0.23796331882476807, -0.0800635814666748], [-0.24646174907684326, -0.010037392377853394, -0.016443461179733276, 0.12552949786186218, 0.23343446850776672, 0.005513489246368408, 0.24222269654273987, 0.18466845154762268, -0.22425228357315063, -0.004509270191192627, 0.11614280939102173, 0.030772149562835693, 0.2886699140071869, 0.13475605845451355, -0.06932562589645386, -0.1464257836341858, -0.026998162269592285, -0.10844802856445312, -0.17216989398002625, 0.13523346185684204, -0.02964290976524353, 0.2960505187511444, 0.16236624121665955, 0.08415815234184265, 0.00833788514137268, 0.015742391347885132, 0.04609215259552002, -0.280178427696228, -0.19922733306884766, 0.02764892578125, -0.03578132390975952, -0.023808211088180542]], "dtype": "float32"}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.1, "seed": 19, "noise_shape": null}, "registered_name": null, "name": "dropout", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["add", 0, 0]}}], "kwargs": {"training": false}}]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "my_attention_0", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "num_heads": 4, "key_dim": 32, "value_dim": 32, "dropout": 0.0, "use_bias": true, "use_gate": false, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": 19}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "seed": null}, "registered_name": null, "build_config": {"shapes_dict": {"query_shape": [null, 19, 32], "value_shape": [null, 19, 32]}}, "name": "my_attention_0", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["dropout", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["dropout", 0, 0]}}], "kwargs": {"return_attention_scores": true}}]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.1, "seed": 19, "noise_shape": null}, "registered_name": null, "name": "dropout_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["my_attention_0", 0, 0]}}], "kwargs": {"training": false}}]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 19, 32], [null, 19, 32]]}, "name": "add_1", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["dropout", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["dropout_2", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "layer_normalization", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": [-1], "epsilon": 0.001, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 19, 32]}, "name": "layer_normalization", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["add_1", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": 19}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}, "registered_name": null, "build_config": {"input_shape": [null, 19, 32]}, "name": "dense_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["layer_normalization", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.1, "seed": 19, "noise_shape": null}, "registered_name": null, "name": "dropout_3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["dense_1", 0, 0]}}], "kwargs": {"training": false}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": 19}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}, "registered_name": null, "build_config": {"input_shape": [null, 19, 32]}, "name": "dense_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["dropout_3", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 19, 32], [null, 19, 32]]}, "name": "add_2", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["layer_normalization", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["dense_2", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "layer_normalization_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": [-1], "epsilon": 0.001, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 19, 32]}, "name": "layer_normalization_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["add_2", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "my_attention_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "num_heads": 4, "key_dim": 32, "value_dim": 32, "dropout": 0.0, "use_bias": true, "use_gate": false, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": 19}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "seed": null}, "registered_name": null, "build_config": {"shapes_dict": {"query_shape": [null, 19, 32], "value_shape": [null, 19, 32]}}, "name": "my_attention_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["layer_normalization_1", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["layer_normalization_1", 0, 0]}}], "kwargs": {"return_attention_scores": true}}]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.1, "seed": 19, "noise_shape": null}, "registered_name": null, "name": "dropout_5", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["my_attention_1", 0, 0]}}], "kwargs": {"training": false}}]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 19, 32], [null, 19, 32]]}, "name": "add_3", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["layer_normalization_1", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["dropout_5", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "layer_normalization_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": [-1], "epsilon": 0.001, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 19, 32]}, "name": "layer_normalization_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["add_3", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": 19}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}, "registered_name": null, "build_config": {"input_shape": [null, 19, 32]}, "name": "dense_3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["layer_normalization_2", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.1, "seed": 19, "noise_shape": null}, "registered_name": null, "name": "dropout_6", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["dense_3", 0, 0]}}], "kwargs": {"training": false}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": 19}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}, "registered_name": null, "build_config": {"input_shape": [null, 19, 32]}, "name": "dense_4", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["dropout_6", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_4", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 19, 32], [null, 19, 32]]}, "name": "add_4", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["layer_normalization_2", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["dense_4", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "layer_normalization_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": [-1], "epsilon": 0.001, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 19, 32]}, "name": "layer_normalization_3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["add_4", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "data_format": "channels_last", "keepdims": false}, "registered_name": null, "name": "global_average_pooling1d", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 19, 32], "dtype": "float32", "keras_history": ["layer_normalization_3", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "regression_output", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": 19}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}, "registered_name": null, "build_config": {"input_shape": [null, 32]}, "name": "regression_output", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32], "dtype": "float32", "keras_history": ["global_average_pooling1d", 0, 0]}}], "kwargs": {}}]}], "input_layers": ["seq_onehot_input", 0, 0], "output_layers": ["regression_output", 0, 0]}